//Задание 5: Напишите программу, которая запрашивает три цифры(от 0 до 9) 
//и выводит число, получающееся из этих цифр в том же порядке, что и при вводе.
#include<iostream>;
using namespace std;
int main() {
	int a, b, c;
	cin >> a >> b >> c;
	cout << a << b << c;
	return 0;
}